main_menu = '''Главное меню:
    1. Сохранить файл телефонной книги
    2. Показать все контакты
    3. Найти контакт
    4. Добавить контакт
    5. Изменить контакт
    6. Удалить контакт
    7. Выход 
Введите номер необходимого действия:'''

add_or_update_contact = '''Добавление нового контакта:
    1. Добавить телефон существующему контакту
    2. Добавить новый контакт 
    3. Вернуться в Главное меню
Введите номер необходимого действия:'''

edit_contact_or_phone = '''Редактирование контакта:
    1. Изменить данные контакта
    2. Изменить телефон
    3. Вернуться в Главное меню
Введите номер необходимого действия: '''

find_contact_menu = '''Поиск контакта:
    1. Найти контакт
    2. Найти телефон 
Введите номер необходимого действия:'''

delete_contact_menu = '''Удаление контакта:
    1. Удалить контакт
    2. Удалить телефон
    3. Вернуться в Главное меню
Введите номер необходимого действия: '''

confirm_delete_menu = '''Подтверждение:
    1. Да
    2. Нет
Введите номер необходимого действия: '''

search_contact = '''Введите текст для поиска имени или фамилии контакта: '''

search_phone = '''Введите текст для поиска номера телефона: '''

data_new_contact = '''Введите имя: 
Введите фамилию: 
Введите телефон: 
Введите комментарий: '''

input_user_id = '''Введите id контакта: '''