main_menu = '''Главное меню:
    1. Открыть файл телефонной книги
    2. Сохранить файл телефонной книги
    3. Показать все контакты
    4. Найти контакт
    5. Добавить контакт
    6. Изменить контакт
    7. Удалить контакт
    8. Выход '''

add_or_update_contact = '''Выбор действия:
    1. Добавить телефон существующему контакту
    2. Добавить новый контакт
    3. Отменить и вернуться в Главное меню '''

edit_contact_or_phone = '''Выбор действия:
    1. Изменить данные контакта
    2. Изменить телефон
    3. Отменить и вернуться в Главное меню '''