main_menu = '''Главное меню:
    1. Сохранить файл телефонной книги
    2. Показать все контакты
    3. Найти контакт
    4. Добавить контакт
    5. Изменить контакт
    6. Удалить контакт
    7. Выход '''

add_or_update_contact = '''Выбор действия:
    1. Добавить телефон существующему контакту
    2. Добавить новый контакт '''

edit_contact_or_phone = '''Выбор действия:
    1. Изменить данные контакта
    2. Изменить телефон '''

find_contact_menu = '''Выбор действия:
    1. Найти контакт
    2. Найти телефон '''

delete_contact_menu = '''Выбор действия:
    1. Удалить контакт
    2. Удалить телефон '''

confirm_delete_menu = '''Подтвердите действие:
    1. Да
    2. Нет '''